namespace Pizza
{
    public static class Program
    {
        /*
        Вимоги до екзаменаційного додатку:
         - використання наслідування
         - застосування поліморфізму (virtual, abstract)
         - використання колекцій
         - використання інтерфейсів
         - використання серіалізації
         - використання делегатів/подій
         - використання LINQ

        Піцерія 
            Створити ієрархію класів для подання інформації про піцу.
            Піцу клієнт може замовляти 
                стандартну(яку пропонує піцерія),
                складену за смаком клієнта(клієн сам складає піцу)
            Створити програму для роботи піцерії
                Додавання(вилучення. редагування)  піци у(з)  базу
                Додавання(вилучення. редагування)  продуктів у(з)  базу
                Збереження бази піц у файлі
                Завантаження бази піц з файлу
                Перегляд  готових піц(складників, ціни)
                Пошук піц по складникам 
                Замовлення піци клієнтом(ами), враховуючи можливе складання піци клієнтом
                Розрахунок клієнта(друк чеку, прийом оплати)
        */

        static void Main()
        {
            ISerializer serializer = new JsonFileSerializer();

            IServiceFactory serviceFactory = new ServiceFactory(serializer);

            using (UserInterface userInterface = new UserInterface(serviceFactory))
            {
                userInterface.Run();
            }
        }
    }
}